var rply ={type : 'text'}; //type是必需的,但可以更改

//////////////// 系統更新
function UpdateLog() {
	rply.text = '【更新紀錄】 遊戲發展史(誤)\
		\n2018/3/3:\
		\n 1.BOT維護:\
		\n   (1)刪除「賀歲抽籤」\
		\n   (2)改善招募系統\
		\n   (3)重要資訊處追加「人物介紹」\
		\n\
		\n2018/2/9:\
		\n 1.技能變動\
		\n   (1)冰獄彈:冰寒標記改為60%賦予\
		\n   (2)轟炎彈:有冰寒標記時的命中率改為90%\
		\n\
		\n 2.追加新技能:劍聖的教誨,大賢者的知惠,箭神的心得,狂戰士的回憶,牧師的專業,不滅意志\
		\n\
		\n2018/2/3:\
		\n 1.Bot強化:\
		\n   (1)將更新紀錄從公告中分開，獨立建立「更新紀錄」，可輸入[更新紀錄]確認\
		\n   (2)重要資訊處追加「武器適性一覽表」\
		\n   (3)新手教學說明追加武器適性相關\
		\n\
		\n 2.技能變動\
		\n   (1)斬擊:傷害變更為自身攻擊力x(1d4)x0.5\
		\n   (2)火球:傷害變更為自身攻擊力+1d5\
		\n\
		\n 3.新系統「武器適性」追加:\
		\n   說明:當你使用技能對應到武器時，除了消耗mp-50%以外，還會對應武器發揮效果!\
		\n\
		\n2018/1/31:\
		\n 1.追加新技能:魔導劍擊,魔導穿槍,魔導狙擊,魔導彈,舉劍,隱藏術,怒吼,咒術筆記\
		\n\
		\n Bot強化:修正部分文字問題\
		\n2018/1/30:\
		\n 1.技能變動\
		\n (1)治癒:回復量變更為1d10+自身最大HPx0.1\
		\n\
		\n 2.新手教學變更\
		\n (1)新人考試官HP:80->60\
		\n\
		\n2018/1/9:\
		\n 1.Bot強化:\
		\n (1)追加每日祈願功能\
		\n (2)追加新手教學說明功能\
		\n (3)修正部分文字錯誤\
		\n 2.追加新技能:冰獄彈,冰牆,轟炎彈,麻痺箭,劇毒箭,燃燒箭,狙擊姿態,重劈,猛虎一式,獵龍一式,蒼藍利刃\
		\n 3.主線追加序言,序章\
		\n2018/1/2:\
		\n 1.Bot強化:\
		\n (1)改善招募結果，追加總計獲得的夥伴及伙伴碎片\
		\n 2.重要更新:\
		\n未來只要完成「新手教學」全部流程的玩家，將可獲得 火球、治癒、斬擊 三本技能書中尚未獲得的技能書\
		\n已經完成的玩家將自動追加技能書，請至玩家存檔確認\
		\n\
		\n 2018/1/1:\
		\n 1.Bot強化:\
		\n (1)Bot追加主線關卡確認功能，請輸入[主線]確認\
		\n (2)Bot追加公告確認功能，請輸入[公告]確認\
		\n (3)Bot追加當前活動確認功能，請輸入[活動]確認\
		\n\
		\n  2017/12/31: \
		\n  1.重要更新:\
		\n(1)本遊戲bot更換成專用bot 空音\
		\n(2)招募方式變更，詳細請輸入[招募]確認\
		\n 2017/12/30 之前的紀錄請至文章區->更新紀錄確認';
}

////////////////
module.exports = {
	UpdateLog
};

